cli/lsof.org
#+TITLE:     Lsof
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
#+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>


* 基本原理

LiSt Open File

** 常用选项

- -a : 进行 =与= 运算（默认是 *或* 逻辑）

- -l : 显示用户 ID ，而不是用户名

- -t : 仅获取进程 ID

- -F : 格式化输出结果，如 =-F pc= （列出进程 ID，命令名）

- -n : 避免域名解析

- -P : 避免端口解析

* 用法示例

** 列出所有程序打开的文件

=lsof=

** 列出所有使用这些文件的程序

#+BEGIN_SRC sh
  lsof /path/to/file1 /path/to/file2
#+END_SRC

** 查看指定路径下所有正在被使用的文件

#+BEGIN_SRC sh
  lsof +D /path  ## 递归
  lsof +d /path  ## 非递归
#+END_SRC

** 列出被某一进程所使用的文件

#+BEGIN_SRC sh
  lsof -p <pid>
#+END_SRC


** 查看 socket 信息

#+BEGIN_SRC sh
  lsof -i [46][protocol][@hostname|hostaddr][:service|port]
#+END_SRC

#+BEGIN_SRC sh
  lsof -i
  lsof -i 4
  lsof -i :80
  lsof -i tcp
  lsof -i tcp:80
  lsof -i @<ip>
  lsof -i @<ip>:<port>
#+END_SRC

** 查看各种状态的 TCP 连接

#+BEGIN_SRC sh
  lsof -iTCP -sTCP:LISTEN
#+END_SRC


常见状态有：

- CLOSED
- IDLE
- BOUND
- LISTEN
- ESTABLISHED
- SYN_SENT
- SYN_RCDV
- ESTABLISHED
- CLOSE_WAIT
- FIN_WAIT1
- CLOSING
- LAST_ACK
- FIN_WAIT_2
- TIME_WAIT


** 查看指定文件描述符的文件

#+BEGIN_SRC sh
  lsof -d <fd>
#+END_SRC

** 结束所有监听在本地接口的进程

#+BEGIN_SRC sh
  kill -9 `lsof -i@127.0.0.1 -t`
#+END_SRC


** 循环监控

#+BEGIN_SRC sh
  lsof -r <second>
  lsof -i:80 -r 1m"=== %T ==="
#+END_SRC

** 监控指定用户打开的文件

#+BEGIN_SRC sh
  lsof -u root
  lsof -u ^root  ## 非
#+END_SRC

** 查看内存映射文件

#+BEGIN_SRC sh
  lsof -d mem
#+END_SRC

** 恢复误删的文件

*** 第一步：找到使用误删文件的进程及文件描述符

#+BEGIN_SRC sh
  $ lsof | grep 'karaf.log'
  java 1283 root 2w REG 3,3 5381017 1773647 /var/log/karaf.log (deleted)
#+END_SRC


*** 第二步：重定向

#+BEGIN_SRC sh
  cat /proc/1283/fd/2 > /var/log/karaf.log
#+END_SRC
