cli/lsof.html
<!DOCTYPE html>
<html>
<head>
<title>Lsof</title>
<!-- 2018-02-07 Wed 15:24 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Lsof</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本原理</a>
<ul>
<li><a href="#sec-1-1">1.1. 常用选项</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 用法示例</a>
<ul>
<li><a href="#sec-2-1">2.1. 列出所有程序打开的文件</a></li>
<li><a href="#sec-2-2">2.2. 列出所有使用这些文件的程序</a></li>
<li><a href="#sec-2-3">2.3. 查看指定路径下所有正在被使用的文件</a></li>
<li><a href="#sec-2-4">2.4. 列出被某一进程所使用的文件</a></li>
<li><a href="#sec-2-5">2.5. 查看 socket 信息</a></li>
<li><a href="#sec-2-6">2.6. 查看各种状态的 TCP 连接</a></li>
<li><a href="#sec-2-7">2.7. 查看指定文件描述符的文件</a></li>
<li><a href="#sec-2-8">2.8. 结束所有监听在本地接口的进程</a></li>
<li><a href="#sec-2-9">2.9. 循环监控</a></li>
<li><a href="#sec-2-10">2.10. 监控指定用户打开的文件</a></li>
<li><a href="#sec-2-11">2.11. 查看内存映射文件</a></li>
<li><a href="#sec-2-12">2.12. 恢复误删的文件</a>
<ul>
<li><a href="#sec-2-12-1">2.12.1. 第一步：找到使用误删文件的进程及文件描述符</a></li>
<li><a href="#sec-2-12-2">2.12.2. 第二步：重定向</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本原理</a>
<ul>
<li><a href="#sec-1-1">1.1. 常用选项</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 用法示例</a>
<ul>
<li><a href="#sec-2-1">2.1. 列出所有程序打开的文件</a></li>
<li><a href="#sec-2-2">2.2. 列出所有使用这些文件的程序</a></li>
<li><a href="#sec-2-3">2.3. 查看指定路径下所有正在被使用的文件</a></li>
<li><a href="#sec-2-4">2.4. 列出被某一进程所使用的文件</a></li>
<li><a href="#sec-2-5">2.5. 查看 socket 信息</a></li>
<li><a href="#sec-2-6">2.6. 查看各种状态的 TCP 连接</a></li>
<li><a href="#sec-2-7">2.7. 查看指定文件描述符的文件</a></li>
<li><a href="#sec-2-8">2.8. 结束所有监听在本地接口的进程</a></li>
<li><a href="#sec-2-9">2.9. 循环监控</a></li>
<li><a href="#sec-2-10">2.10. 监控指定用户打开的文件</a></li>
<li><a href="#sec-2-11">2.11. 查看内存映射文件</a></li>
<li><a href="#sec-2-12">2.12. 恢复误删的文件</a>
<ul>
<li><a href="#sec-2-12-1">2.12.1. 第一步：找到使用误删文件的进程及文件描述符</a></li>
<li><a href="#sec-2-12-2">2.12.2. 第二步：重定向</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-07 15:24:19</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本原理</h2>
<div class="outline-text-2" id="text-1">
<p>
LiSt Open File
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 常用选项</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>-a : 进行 <code>与</code> 运算（默认是 <b>或</b> 逻辑）
</li>

<li>-l : 显示用户 ID ，而不是用户名
</li>

<li>-t : 仅获取进程 ID
</li>

<li>-F : 格式化输出结果，如 <code>-F pc</code> （列出进程 ID，命令名）
</li>

<li>-n : 避免域名解析
</li>

<li>-P : 避免端口解析
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 用法示例</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 列出所有程序打开的文件</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>lsof</code>
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 列出所有使用这些文件的程序</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">lsof /path/to/file1 /path/to/file2
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 查看指定路径下所有正在被使用的文件</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">lsof +D /path  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#36882;&#24402;</span>
lsof +d /path  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#38750;&#36882;&#24402;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 列出被某一进程所使用的文件</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">lsof -p &lt;pid&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 查看 socket 信息</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sh">lsof -i [46][protocol][@hostname|hostaddr][:service|port]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">lsof -i
lsof -i 4
lsof -i :80
lsof -i tcp
lsof -i tcp:80
lsof -i @&lt;ip&gt;
lsof -i @&lt;ip&gt;:&lt;port&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 查看各种状态的 TCP 连接</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">

<pre class="src src-sh">lsof -iTCP -sTCP:LISTEN
</pre>
</div>


<p>
常见状态有：
</p>

<ul class="org-ul">
<li>CLOSED
</li>
<li>IDLE
</li>
<li>BOUND
</li>
<li>LISTEN
</li>
<li>ESTABLISHED
</li>
<li>SYN_SENT
</li>
<li>SYN_RCDV
</li>
<li>ESTABLISHED
</li>
<li>CLOSE_WAIT
</li>
<li>FIN_WAIT1
</li>
<li>CLOSING
</li>
<li>LAST_ACK
</li>
<li>FIN_WAIT_2
</li>
<li>TIME_WAIT
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> 查看指定文件描述符的文件</h3>
<div class="outline-text-3" id="text-2-7">
<div class="org-src-container">

<pre class="src src-sh">lsof -d &lt;fd&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> 结束所有监听在本地接口的进程</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">kill</span> -9 <span style="color: #fa8072;">`lsof -i@127.0.0.1 -t`</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9"><span class="section-number-3">2.9</span> 循环监控</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">

<pre class="src src-sh">lsof -r &lt;second&gt;
lsof -i:80 -r 1m<span style="color: #00afaf;">"=== %T ==="</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-10" class="outline-3">
<h3 id="sec-2-10"><span class="section-number-3">2.10</span> 监控指定用户打开的文件</h3>
<div class="outline-text-3" id="text-2-10">
<div class="org-src-container">

<pre class="src src-sh">lsof -u root
lsof -u ^root  <span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#38750;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-11" class="outline-3">
<h3 id="sec-2-11"><span class="section-number-3">2.11</span> 查看内存映射文件</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">

<pre class="src src-sh">lsof -d mem
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-12" class="outline-3">
<h3 id="sec-2-12"><span class="section-number-3">2.12</span> 恢复误删的文件</h3>
<div class="outline-text-3" id="text-2-12">
</div><div id="outline-container-sec-2-12-1" class="outline-4">
<h4 id="sec-2-12-1"><span class="section-number-4">2.12.1</span> 第一步：找到使用误删文件的进程及文件描述符</h4>
<div class="outline-text-4" id="text-2-12-1">
<div class="org-src-container">

<pre class="src src-sh">$ lsof | grep <span style="color: #00afaf;">'karaf.log'</span>
java 1283 root 2w REG 3,3 5381017 1773647 /var/log/karaf.log (deleted)
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-12-2" class="outline-4">
<h4 id="sec-2-12-2"><span class="section-number-4">2.12.2</span> 第二步：重定向</h4>
<div class="outline-text-4" id="text-2-12-2">
<div class="org-src-container">

<pre class="src src-sh">cat /proc/1283/fd/2 &gt; /var/log/karaf.log
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>